{
  "_local_":                  "en-US",

  "_GilEpshtain_":            "Gil Epshtain",

  "_Home_":                   "Home",
  "_About_":                  "About",
  "_Experience_":             "Experience",
  "_Projects_":               "Projects",
  "_Services_":               "Services",
  "_Employers_":              "Employers",
  "_Contact_":                "Contact",

  "_HomePageQuote_P1_":       "The true sign of intelligence is",
  "_HomePageQuote_P2_":       "not knowledge but imagination",
  "_HomePageQuote_P3_":       "Albert Einstein",

  "_AboutTitle_":             "ABOUT",
  "_AboutText_":              "",
  "_HelloIAm_":               "Hello everybody, I’m",
  "_WebDeveloper_":           "Web and Mobile Developer, Expert of the Client Side",
  "_AboutMeText_":            "I’ve been developing websites all the way back to the dark ages of Web1.0, Netscape and Internet Explorer 1.x. Already back then I fell in love in the Internet and its ecosystem. Since then I have finished my academic degree and I have become a professional web developer. Adding to this my passion for designing and creative thinking will make me the perfect choice for your next big web project.",

  "_SkillsTitle_":            "SKILLS",
  "_SkillTitle_1_":           "Web Developer",
  "_SkillValue_1_":           "96%",
  "_SkillText_1_":            "Expert of the client side as it is today, and how it evolved over the past 20 years. Experience with a ton of different frameworks and libraries, both open source and commercial. Experience in building the front-end architecture with all it's layers - Developing and Transpiling, Linting, Bundling, Package managing, Testing, and much much more...",
  "_SkillTitle_2_":           "Web Architecture",
  "_SkillValue_2_":           "92%",
  "_SkillText_2_":            "I have a great understanding of internet architecture. The relationship between the different components on the internet (Client, Middle Tier, Server, Communications). The way these components communicate (different internet protocols: HTTP, FTP, SMTP, TCP, UDP, IP, etc..).",
  "_SkillTitle_3_":           "Web Design",
  "_SkillValue_3_":           "83%",
  "_SkillText_3_":            "Experience in both the basic web design tools (Html, Css) as well as advanced style pre-processors (Sass, Less). High level of understanding of graphic design (GUI) as well as user experience (UX). Knowledge of different tools for designing icons, fonts, templates, and more. Admiring art in both personal and professional life.",

  "_ExperienceTitle_":        "EXPERIENCE",    
  "_ExperienceCompany_1_":    "Frontline PCB", 
  "_ExperiencePosition_1_":   "QA Engineer",
  "_ExperienceYears_1_":      "2012-2014",
  "_ExperienceUrl_1_":        "https://www.frontline-pcb.com/",
  "_ExperienceText_1_":       "Student position. Manual software testing for the engineering products line. Software that provides solutions for PCB (printed circuit boards) manufacturer. Working parallel to the R&D team. Using Oracle 10G-11G databases. Writing testing documents (STD, STP). Developing test automation in Perl. Working in the Scrum methodology (Agile software development framework). Familiarity with SharePoint, VersionOne and TeamTrack web services.",
  "_ExperienceCompany_2_":    "Conceptic", 
  "_ExperiencePosition_2_":   "Full Stack Developer",
  "_ExperienceYears_2_":      "2014-2015",
  "_ExperienceUrl_2_":        "https://emenu-international.com/",
  "_ExperienceText_2_":       "Software engineer at the research and development team at Conceptic. A company that provide electronic menus for restaurants on iPad, Android platform. Working on the CMS application – that provide a user friendly way to manage the eMenu's application data. Working on the project starting from the design stage up to the implementation stage. Developing the server side of the application in Asp.Net technology using C#. Developing the client side of the application in Html5, JavaScript, CSS, jQuery, Ajax technologies. Developing the database with SQL. Responsible on both the logic and the graphic sides of the application.",
  "_ExperienceCompany_3_":    "OnoApps", 
  "_ExperiencePosition_3_":   "Mobile Developer",
  "_ExperienceYears_3_":      "2015-2016",
  "_ExperienceUrl_3_":        "http://onoapps.com/",
  "_ExperienceText_3_":       "Part of the Hybrid Applications development team at OnO Apps, working on a large variety of mobile apps. Developing applications for mobile phones running Android or iOS platform using web technologies (Hybrid application). Developing the app with JavaScript and designing the app with Html5 and Css3. Compiling the app to Native code with Cordova (Phone Gap). Working with Native plugins in Java and Objective C (for both platforms). Developing in the latest frameworks such as AngularJS, EmberJS, Ionic and many more.",
  "_ExperienceCompany_4_":    "Cellcom TV", 
  "_ExperiencePosition_4_":   "Head of Mobile Development",
  "_ExperienceYears_4_":      "2015-2016",
  "_ExperienceUrl_4_":        "https://cellcomtv.cellcom.co.il/",
  "_ExperienceText_4_":       "Application manager and head developer of the CellcomTV mobile app - Live TV channels and VOD broadcast on your Android and iOS mobile phones and tablets. Single handedly developing the application. Developing the UI of the application with web technologies, using JavaScript with EmberJS framework. Working on the Native video players in Java and Objective-C, on each platform. Responsible on both the development of the application and application management, working parallel to the product department.",
  "_ExperienceCompany_5_":    "Qognify", 
  "_ExperiencePosition_5_":   "Client Side Expert",
  "_ExperienceYears_5_":      "2016-2018",
  "_ExperienceUrl_5_":        "https://www.qognify.com/",
  "_ExperienceText_5_":       "Developing the VisionHub web - video management system (VMS). Working on extremely large scale application with enormous code base. Developing in TypeScript, on Microsoft environment. Great attention to software architecture and design. Extensive use of design patterns.",
  "_ExperienceCompany_6_":    "Septier", 
  "_ExperiencePosition_6_":   "Front End Expert",
  "_ExperienceYears_6_":      "2018 till present day",
  "_ExperienceUrl_6_":        "https://www.septier.com/",
  "_ExperienceText_6_":       "TBD",

  "_EducationTitle_":         "EDUCATION",    
  "_EducationInstitution_":   "HIT - Holon Institute of Technology", 
  "_EducationDegree_":        "B.Sc (Bachelor's Degree) in Computer Science.",
  "_EducationYears_":         "2012-2014",
  "_EducationUrl_":           "http://www.hit.ac.il/en",
  "_EducationText_":          "Graduated in the top of my class with a GPA of 96%.",

  "_ProjectsTitle_":          "PROJECTS",
  "_ProjectsText_":           "In this section, you can see a partial list of my projects. This list will contain educational projects, recreational projects and a small taste of commercial projects, as well.",
  "_ProjectTitle_1_":         "Space Invaders",
  "_ProjectText_1_":          "A small game I have developed during my studies. This game was developed in XNA environment in .Net framework",
  "_ProjectTitle_2_":         "Cellcom TV",
  "_ProjectText_2_":          "A video streaming mobile application I have developed for Cellcom. Developed in EmberJS framework.",
  "_ProjectTitle_3_":         "Vision Hub",
  "_ProjectText_3_":          "A VMS (video management system) application for security companies, developed with my help for Qognify LTD. Developed in TypeScript with AngularJS framework",

  "_ServicesTitle_":          "SERVICES",
  "_ServicesText_":           "Need some professional help building your next web-project? Below you can see a list of services I provide. Your requirement does not quite fit any of my services, contact me and I'm sure we could find some way to promote a solution to your need.",
  "_ServiceTitle_1_":         "Web Development",
  "_ServiceText_1_":          "Building websites and web-application in the highest standards, with the latest technologies",
  "_ServiceTitle_2_":         "Web Design",
  "_ServiceText_2_":          "Designing application in a modern look, with friendly user experience, in the latest web standards.",
  "_ServiceTitle_3_":         "Architecture Design",
  "_ServiceText_3_":          "Designing the software architecture with design patterns, to allow easy future developments of new features, without breaking the existing components.",
  "_ServiceTitle_4_":         "Consultant",
  "_ServiceText_4_":          "providing consultant on how to build web applications, organizing projects and solving development problems.",

  "_WorkProcessTitle_":       "WORK PROCESS",
  "_WorkProcessText_":        "Want to understand how I work? What I do? Why I do it? This is my development workflow.",
  "_WorkProcessTitle_1_":     "RESEARCH",
  "_WorkProcessText_1_":      "Every project starts with a research. First I'm understanding the client requirements. Then I find the best way to meet these requirements.",
  "_WorkProcessTitle_2_":     "DESIGN",
  "_WorkProcessText_2_":      "Once I find the best solution for the project, I will design the best software architecture for implementing this solution.",
  "_WorkProcessTitle_3_":     "DEVELOPMENT",
  "_WorkProcessText_3_":      "The development process is the main work I will be conducting. In this section, I will write the code, and create your application.",
  "_WorkProcessTitle_4_":     "TEST",
  "_WorkProcessText_4_":      "After the application was created it's time to run quality assurance tests. To see we don't have any problems with our application.",
  "_WorkProcessTitle_5_":     "STABILIZATION",
  "_WorkProcessText_5_":      "Now that we have found all the bugs in the system, and tested all the edge cases. It's time to fix these issues and stabilize the application.",
  "_WorkProcessTitle_6_":     "DELIVERY",
  "_WorkProcessText_6_":      "Releasing the product to the customer, and providing a maintenance package if needed.",

  "_ContactTitle_":           "CONTACT", 
  "_ContactText_":            "If you have any question, problem or you just want some advice, fill free to contact me, and I will do my best to provide an answer to your issue.",  
  "_EMail_":                  "E-Mail",
  "_EMailValue_":             "Gil_Epshtain@yahoo.com",
  "_Phone_":                  "Phone",
  "_PhoneValue_":             "Private, please use eMail",
  "_Address_":                "Address",
  "_AddressValue_":           "Private, please use eMail",

  "_Name_":                   "Name",
  "_Message_":                "Message",
  "_Send_":                   "Send",
  "_FormInvalidName_":        "Name must be between 2 to 32 characters long.",
  "_FormInvalidEMail_":       "E-Mail format invalid.",
  "_FormInvalidMessage_":     "Message is required.",
  "_MessageSent_":            "Message was send, Thank you.",

  "_SocialMediaTitle_1_":     "Facebook", 
  "_SocialMediaUrl_1_":       "https://www.facebook.com/Gil.Epshtain",
  "_SocialMediaTitle_2_":     "LinkedIn", 
  "_SocialMediaUrl_2_":       "https://www.linkedin.com/in/Gil-Epshtain-41134570",
  "_SocialMediaTitle_3_":     "Google+", 
  "_SocialMediaUrl_3_":       "https://plus.google.com/114479878076096432932",
  "_SocialMediaTitle_4_":     "Stack Overflow", 
  "_SocialMediaUrl_4_":       "https://stackoverflow.com/users/2658683/Gil-Epshtain",
  "_SocialMediaTitle_5_":     "GitHub", 
  "_SocialMediaUrl_5_":       "https://github.com/Gil-Epshtain",

  "_DevelopedByGilE_":        "Developed and Designed by Gil Epshtain",
  "_RightsReserved_":         "2017-2018, All rights reserved.",

  "fin": "end"
}